posts/using-hakyll-org-bootstrap.html

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The New Setup</h2>
<div class="outline-text-2" id="text-1">
<p>
I decided to update my blogging setup a bit.
I had in the back of my mind a new setup and this weekend, I needed
a mental break and this seemed like a good use of an afternoon.
My new setup needed to meet the following requirements.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Requirements</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Static site. This way, I do not have to deal with hosting or
security issues.  Ideally, the static site generator would be
written in a language that I know and am comfortable with.
</li>
<li>Support authoring posts in <a href="http://orgmode.org/">Org-mode</a>. This would be a
supermodular in utility for me, because I already heavily use
Org-mode for managing my TODO lists, calendar, writing papers,
taking notes, and citing papers.
</li>
<li>Enable customization without requiring it.  With Octopress, I
felt a bit stuck to simply applying pre-applied themes.
</li>
<li>Allow me to use <a href="http://getbootstrap.com/">Bootstrap</a>. I am not a designer, so I want to
leverage other peoples' work in this area.
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The software stack</h2>
<div class="outline-text-2" id="text-2">
<table class="table table-hover table-bordered">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Component</th>
<th scope="col" class="left">Purpose</th>
<th scope="col" class="left">Language</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><a href="http://jaspervdj.be/hakyll/">Hakyll</a></td>
<td class="left">Site generator</td>
<td class="left">Haskell</td>
</tr>

<tr>
<td class="left"><a href="http://getbootstrap.com/">Bootstrap</a></td>
<td class="left">Layout and theme</td>
<td class="left">CSS, Javascript</td>
</tr>

<tr>
<td class="left"><a href="http://www.gnu.org/software/emacs/">Emacs</a> + <a href="http://orgmode.org/">Org-mode</a></td>
<td class="left"><a href="http://orgmode.org/manual/HTML-export.html">Generating HTML</a></td>
<td class="left">Org-mode, LISP</td>
</tr>

<tr>
<td class="left"><a href="https://hackage.haskell.org/package/shake">Shake</a></td>
<td class="left">Build system</td>
<td class="left">Haskell DSL</td>
</tr>
</tbody>
</table>
</div>



<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Why these components?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>NOTE:</b> I am writing this system so I remember why I made the
choices that I have, outsourcing my memory to a more reliable
substrate than my own.
</p>

<p>
<a href="http://jaspervdj.be/hakyll/">Hakyll</a> had what I was looking for in a site generator.  It
generates static sites and seems to have an active community.  Its
role is to take content, apply transformations, apply templates and
CSS, and generate the HTML comprising the website itself.
<a href="http://www.reddit.com/r/haskell/comments/23xgzf/thoughts_on_hakyll_vs_octopress_for_an/">This discussion</a> on the <a href="http://reddit.com/r/haskell">Haskell subreddit</a> was very helpful.
</p>


<p>
<a href="http://getbootstrap.com/">Bootstrap</a> sites look really nice, and seem to be really popular.  I
want to give myself the option to customize the site later, (or
hire someone else to do so), and Bootstrap seems <a href="http://en.wikipedia.org/wiki/Network_effect">extremely popular</a>.
It seems very customizable, but at the same time it did not take
much work at all to get things set up. I know very little about
HTML and CSS and do not want to jump too far down that rabbit hole
at the moment. I may experiment with the <a href="http://bootswatch.com/darkly/">Darkly</a> bootstrap theme.
</p>

<p>
To get started, I forked <a href="http://www.stephendiehl.com/">Stephen Diehl's</a> <a href="https://github.com/sdiehl/hakyll-bootstrap">Hakyll-Bootstrap</a>
repository, which is a barebones bootstrap-based site generated
using Hakyll.
</p>

<p>
<a href="http://orgmode.org/">Org-mode</a> needs its own writeup. I have been building up my org-mode
setup gradually since being an undergrad. It manages my calendar,
TODO lists, and everything. I am very comfortable writing in
org-mode, and it is easier for me to write documents with
citations, tables, and equations using org-mode rather than
Markdown. Note, I am using Org-mode to generate the HTML, rather
than Pandoc. This gives me a bit more control over the HTML. 
</p>

<p>
<a href="https://hackage.haskell.org/package/shake">Shake</a> is a build system. I will be using this simply to manage
exporting the Org-mode files for the HTML export, and run the
script to generate the metadata files.
</p>
</div>
</div>
</div>




<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Details of the setup, how to get started</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Fork <a href="https://github.com/sdiehl/hakyll-bootstrap">Hakyll-Bootstrap</a> and follow the build instructions
</li>
<li>Create a <code>posts-src</code> folder at the root. 
This is where the <code>.org</code> flies go.
</li>
<li>Write some content.
</li>
<li>Add any necessary tags using <code>ATTR_HTML</code>.
In the <i>A post template</i> section, see that I added a few classes to the table.
This allowed the bootstrap to style these tables.
</li>
<li>Create an exporter for <code>HTML</code> files in Hakyll's Main.hs. 
See <a href="https://github.com/stephenjbarr/hakyll-bootstrap/commit/3bd736c94295b1b6f24865c763af869bd4787cca?diff=split&short_path=aacb4ce#diff-0">this diff</a> for the changes.
</li>
<li>To export from Org-mode to HTML, from Emacs do <code>C-c C-e C-b h h</code>
(yes, it's Emacs :) ).  The <code>C-c C-e</code> turns on the export option,
<code>C-b</code> toggles body-only export, the first <code>h</code> is for HTML export,
the second <code>h</code> is for export html to file.  The idea of doing a
body-only export is that Hakyll is applying the templates,
inserting the nav bars, etc.
</li>
<li>Compile and run Hakyll
</li>
<li>Visit <a href="http://localhost:8000">http://localhost:8000</a> to see your new site!
</li>
</ol>
</div>




<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> A post template</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The <code>org-mode</code> source to a post could look like this:
</p>

<script src="https://gist.github.com/stephenjbarr/cd51b2f951e42615f48c.js"></script>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> List of use cases to test / figure out / document</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> <span class="todo TODO">TODO</span> Citing papers with <a href="http://kitchingroup.cheme.cmu.edu/blog/2014/05/13/Using-org-ref-for-citations-and-references/">org-ref</a></h3>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <span class="todo TODO">TODO</span> Source code embedding without using Github gists</h3>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> <span class="todo TODO">TODO</span> Automate exporting of <code>.org</code> to <code>.html</code> using a build system (Shake)</h3>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> <span class="todo TODO">TODO</span> Understand how to toggle posts being previewed without being published</h3>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> <span class="todo TODO">TODO</span> How to use tags within Hakyll</h3>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> <span class="todo TODO">TODO</span> Make sure org-mode tags become Hakyll tags</h3>
<div class="outline-text-3" id="text-4-6">
<p>
The plan is to update this page as I figure out the above tasks.
</p>
</div>
</div>
</div>
